Repository: harmonydata/harmony_original
Catalog: front_end/locale/*/LC_MESSAGES/body.po
Languages: pt

source: Could not find any preprocessed questionnaires
pt: Não foi possível encontrar nenhum questionário pré-processado

source: The document selector menu will be hidden.
pt: O menu de seleção de documentos será ocultado.

source: Choose existing questionnaires
pt: Escolha entre os questionários disponíveis

source: or
pt: ou

source: Upload your documents
pt: Carregue seus documentos

source: How should I format the documents?
pt: Como os documentos devem estar formatados?

source: Drag and Drop PDFs or Excels
pt: Arraste e solte arquivos em formato PDF ou Excel (.xlsx)

source: or
pt: ou

source: Select Files from your Computer
pt: Selecione arquivos do seu computador

source: Harmony can read questionnaires in PDF or Excel format, although Excels may give better results. If you're using Excel, each file should be an Excel spreadsheet with a question on each row. You can put multiple questionnaires in a single Excel in different sheets. If you're uploading a PDF file, for best results the questions should be formatted with question numbers, question text and a list of options on each line, e.g. ``` 1. Feeling nervous: Rarely, Sometimes, Often, Always ``` This version of the Harmony tool supports English and Portuguese documents.
pt: O Harmony consegue ler questionários em formato PDF ou Excel (.xlsx), embora arquivos Excel possam trazer melhores resultados. Se você estiver usando o Excel, cada arquivo deve ser uma planilha de Excel com uma pergunta em cada linha. É possível incluir vários questionários em um único arquivo distribuindo-os em abas separadas. Se você estiver enviando um arquivo PDF, para obter melhores resultados, a formatação das perguntas deverá incluir o número da pergunta, o texto da pergunta e uma lista de opções na mesma linha, como no exemplo abaixo: ``` 1. Sentir-se nervoso(a), ansioso(a) ou muito tenso(a): Raramente, Às vezes, Frequentemente, Sempre ``` Esta versão da ferramenta Harmony suporta documentos em inglês e português.

source: Hide tip
pt: Ocultar dica

source: Files selected
pt: Arquivos selecionados

source: These are the questions that Harmony found in your documents.
pt: Estas são as perguntas que o Harmony encontrou em seus documentos.

source: Click to filter by a particular file:
pt: Clique para filtrar por um arquivo específico:

source: ➊ Upload your data
pt: ➊ Carregue seus dados

source: Click to re-calculate all the matching questions
pt: Clique para recalcular todas as perguntas correspondentes

source: Click to save this graph to your computer
pt: Clique para salvar este gráfico em seu computador

source: Show/hide tip
pt: Mostrar/ocultar dica

source: Adjust the sensitivity of the matches. If this is high, only questions with exactly the same text are considered identical. If you don't see any matches, try reducing the sensitivity.
pt: Ajuste a sensibilidade das correspondências. Se estiver alta, apenas as perguntas com exatamente o mesmo texto serão consideradas idênticas. Caso você não encontre nenhuma correspondência, experimente diminuir a sensibilidade.

source: 0% (show everything)
pt: 0% (mostrar tudo)

source: 20% (approximate matches)
pt: 20% (correspondências aproximadas)

source: 80% (close matches)
pt: 80% (correspondências próximas)

source: 100% (exact matches)
pt: 100% (correspondências exatas)

source: You can click on a question or a connection in the graph to add or remove individual links:
pt: Você pode clicar em uma pergunta ou conexão no gráfico para adicionar ou remover ligações específicas:

source: Update value of connection
pt: Atualizar valor da conexão

source: Clear all manual connections
pt: Limpar todas as conexões manuais

source: Please upload some questionnaires under 'Upload your data'.
pt: Por favor, acesse “Carregue seus dados” para enviar alguns questionários.

source: ## Using the graph You can use the scroll wheel on your mouse to zoom in or out. You can also click and drag the graph left or right to pan across it. The percent scores show how close the AI thought two texts matched. Exact matches score 100%. Negative values mean that the texts match but have opposite meanings, e.g. "I feel nervous" vs "I feel relaxed". ## How does Harmony work? *The technical details* The AI converts the text of each question into a vector in 1600 dimensions using a neural network called GPT-2. This technique is called a *document embedding*. The distance between any two questions is measured according to the cosine similarity metric between the two vectors. Two questions which are similar in meaning, even if worded differently or in different languages, will have a high degree of similarity between their vector representations. Questions which are very different tend to be far apart in the vector space. You can read more about how Harmony works [in this blog post](https://harmonydata.org/how-does-harmony-work/).
pt: ## Uso do gráfico Você pode usar o botão de rolagem (scroll) do seu mouse para aumentar ou diminuir o zoom. Você também pode explorar e mover o gráfico clicando e arrastando-o para a esquerda ou direita. Os resultados percentuais indicam o grau de correspondência entre os dois textos identificado pela inteligência artificial (IA). Correspondências exatas têm um percentual de 100%. Valores negativos significam que os textos se correspondem, mas têm sentidos opostos (por exemplo: “Eu me sinto tenso(a)” x “Eu me sinto relaxado(a)”. ## Como o Harmony funciona? *Os detalhes técnicos* A IA converte o texto de cada pergunta em um vetor de 1600 dimensões usando uma rede neural chamada GPT-2. Essa técnica é chamada de *incorporação de documento* (ou “document embedding”, em inglês). A distância entre quaisquer duas perguntas é medida de acordo com a métrica de similaridade de cosseno entre os dois vetores. Duas perguntas com significados semelhantes, mesmo se formuladas de forma diferente ou em idiomas diferentes, terão um alto grau de similaridade entre suas representações vetoriais. Perguntas muito diferentes, por outro lado, tendem a estar distanciadas no espaço vetorial. Você pode ler mais sobre como o Harmony funciona [nesta postagem do blog](https://harmonydata.org/how-does-harmony-work/).

source: ➋ Check the matches
pt: ➋ Verificar correspondências

source: ➌ Export the matches to Excel
pt: ➌ Exportar correspondências para Excel

source: AI tool built by
pt: Ferramenta de IA desenvolvida por

source: View source code on Github
pt: Ver código-fonte no Github

source: Harmony is a tool designed for retrospective harmonisation of questionnaire data. If you want to compare data from different surveys, such as GAD-7 and PHQ-9, Harmony can identify which questions match. Drag and drop your spreadsheets and PDFs of mental health questionnaires into the tool. The AI will harmonise your data. You can export the result to Excel or as an image, and share with colleagues. Read more at [harmonydata.org](https://harmonydata.org). You can also read our [privacy policy](https://harmonydata.org/privacy-policy/). If you have feedback about the tool, feel free to [contact us](https://harmonydata.org/contact/).
pt: O Harmony é uma ferramenta desenvolvida para a harmonização de questionários e perguntas depesquisa. Caso você deseje comparar dados de diferentes questionários, como o GAD-7 e o PHQ-9, o Harmony é capaz de identificar quais perguntas correspondem entre si. Arraste e solte suas planilhas e PDFs de questionários de saúde mental na ferramenta. A IA irá aproximar seus dados. Você pode exportar o resultado em formato Excel ou como uma imagem e compartilhar com colegas. Leia mais em [harmonydata.org](https://harmonydata.org). Você também pode ler nossa [política de privacidade](https://harmonydata.org/privacy-policy/). Se tiver comentários sobre a ferramenta, [escreva-nos uma mensagem](https://harmonydata.org/contact/).

source: at
pt: de

source: (opposite sense)
pt: (sentido oposto)

source: Please wait. The graph is being calculated.
pt: Por favor, espere. O Harmony está calculando o gráfico.

source: Filter questions by category:
pt: Filtrar perguntas por categoria:

source: harmony_flowchart_en.png
pt: harmony_flowchart_pt.png

source: question numbers
pt: identificadores de perguntas

source: questions
pt: perguntas

source: options
pt: opções

source: match
pt: correspondência

source: Filename
pt: Arquivo

source: Field
pt: Campo

source: Language
pt: Língua

source: Unmatched questions
pt: Perguntas sem correspondência

source: positive
pt: positivo

source: negative
pt: negativo

source: no connection
pt: sem correspondência

source: Question No
pt: Número da Pergunta

source: Question
pt: Pergunta

source: Options
pt: Opções

source: Question Category
pt: Categoria da Pergunta

source: File
pt: Arquivo

source: Add row
pt: Nova linha
